package com.youxigu.dynasty2.combat.skill.target;
/**
 * 效果选取目标的方式
 *
 */
public class _package_ {
	/**
	 * 1：自己
	 * 2：对前排单体造成伤害
	 * 3：对后排单体造成伤害
	 * 4：对前排3个单位造成伤害
	 * 5：对后排3个单位造成伤害
	 * 6：对1列敌人造成伤害
	 * 7：对全体敌人造成伤害
	 * 8：己方全体,不包括城墙，城防 ；
	 * 9：己方随机n个部队(不包括城墙)
	 * 10：对自己进行攻击的战斗单元；
	 * 11：敌方随机n个部队(不包括城墙)
	 * 12：己方特定兵种(不包括城墙)
	 * 13：敌方特定兵种(不包括城墙)
	 * 14：敌方特定国家的单位(不包括城墙)
	 * 15：我方特定国家的单位(不包括城墙)
	 * 16：对敌方目标周围
	 * 17：本方血量最高的单位
	 * 18：本方血量最低的单位
	 * 19：敌方血量最高的单位
	 * 20：敌方血量最低的单位
	 * 21：本方在指定buff或状态下的人
	 * 22：敌方在指定buff或状态下的人
	 * 23：全体随机n个部队(不包括城墙)
	 * 24：本方指定的多个sysheroId
	 */
}